{
  "news": [
    {
      "id": "1",
      "name": "England's IPL Players Likely To Miss Test Series Against New Zealand",
      "slug": "england's-ipl-players-likely-to-miss-test-series-against-new-zealand",
      "date": "June 09, 2021",
      "time": "10:00 PM EST",
      "detail": "England are likely to rest their Indian Premier League (IPL) 2021 players for the Test series against New Zealand in order to give the cricketers a break. New Zealand will play England in a two-match Test series which gets underway from June 2 at Lord's in London. According to a report in BBC, England players who featured in IPL 2021 before the tournament was postponed will not be hurriedly picked for the Test series. Chris Woakes, Sam Curran, Moeen Ali, Jos Buttler, and Jonny Bairstow all played at least a game in the postponed IPL and are now in mandatory 10-day isolation after returning to the UK.",
      "image": "/images/blog/Eleicaofuncef1803.jpeg"
    },
    {
      "id": "2",
      "name": "Ferran Torres Hat-Trick Sees Manchester City Hold Off Newcastle United",
      "slug": "ferran-orres-hat-trick-sees-manchester-city-hold-off-newcastle-united",
      "date": "June 2, 2021",
      "time": "8:00 PM EST",
      "detail": "Ferran Torres scored his first Manchester City hat-trick as the newly-crowned English champions twice came from behind to beat Newcastle 4-3 on Saturday. With a third Premier League title in four years sealed with three games to spare, Pep Guardiola again took the chance to hand a number of his fringe players an opportunity to shine two weeks ahead of the Champions League final. Goalkeeper Scott Carson was handed his City debut at 35 and a first Premier League appearance for almost 10 years.",
      "image": "/images/blog/Eleicaofuncef1803.jpeg"
    },
    {
      "id": "3",
      "name": "England Pacer Harry Gurney Retires",
      "slug": "england-pacer-harry-gurney-retires",
      "date": "June 11, 2021",
      "time": "7:00 PM EST",
      "detail": "England seamer and former Kolkata Knight Riders pacer Harry Gurney announced his retirement from cricket after taking 614 all-format wickets during his career in the professional game. The Nottinghamshire pacer bowed out as a result of the shoulder injury that saw him miss the club's 2020 T20 Blast campaign. The time has arrived for me to hang up my boots. After trying to recover from the recent injury to my shoulder, I am truly disappointed to have to end my playing career as a result of it, Gurney captioned a post on Instagram to announce his retirement.",
      "image": "/images/blog/Eleicaofuncef1803.jpeg"
    }
  ]
}
